app/views/epicenter/show_user.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---

<% @user.tweets.each do |tweet| %>