app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @tweets = Tweet.all

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Im jordan DUUUHHHHHHHHH"], ["user_id", 1], ["created_at", "2018-09-10 14:59:59.131697"], ["updated_at", "2018-09-10 14:59:59.131697"]]
UPDATE "tweets" SET "updated_at" = ?, "link" = ? WHERE "tweets"."id" = ?  [["updated_at", "2018-09-12 13:17:21.589328"], ["link", "https://wvmkrbeats.co..."], ["id", 5]]
---
  def create

    @tweet = Tweet.create(tweet_params)

    @tweet = get_tagged(@tweet)

    respond_to do |format|
      if @tweet.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])